# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import numpy as np
import pandas as pd
import scipy.stats as st

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
temp = pd.read_csv(r"C:\Users\Shinemet\Ironhack\Labs\Module2\Lab_10_Subsetting_and_Descriptive_Statistics\Temp_States.csv")

#### Print `temp`.

In [3]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

*2 features are categorical and 1 feature is numerical.*

#### Select the rows where state is New York.

In [5]:
ny = temp[temp['State']=='New York']
ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [6]:
ny['Temperature'].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [7]:
temp[temp['Temperature']>15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [8]:
temp[temp['Temperature']>15]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [9]:
temp[(temp['Temperature']>15) & (temp['Temperature']<20)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [48]:
mean_t = temp.groupby(['State'])['Temperature'].mean()
mean_t

State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
Name: Temperature, dtype: float64

In [50]:
stdev_t = temp.groupby(['State'])['Temperature'].std()
stdev_t

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

#  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [51]:
employees = pd.read_csv(r"C:\Users\Shinemet\Ironhack\Labs\Module2\Lab_10_Subsetting_and_Descriptive_Statistics\Employees.csv")

#### Explore the data types of the `employees` dataframe. Comment your results.

In [73]:
employees.head()

  Department Education      Title      Name  Years  Salary
0      Admin    Master  associate     David      4      58
1         IT    Master  associate    Thomas      7      45
2      Admin    Master  associate     Diana     10      52
3      Admin    Master         VP  Manuella     15      33
4      Sales    Master    Analyst     Carla      6      38

In [59]:
employees.describe()

            Years      Salary
count  500.000000  500.000000
mean     7.556000   73.528000
std      4.465731   26.890061
min      1.000000   30.000000
25%      3.000000   50.000000
50%      7.000000   72.000000
75%     11.250000   97.000000
max     15.000000  120.000000

In [72]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Department  500 non-null    object
 1   Education   500 non-null    object
 2   Title       500 non-null    object
 3   Name        500 non-null    object
 4   Years       500 non-null    int64
 5   Salary      500 non-null    int64
dtypes: int64(2), object(4)
memory usage: 23.6+ KB

*The dataset has 2 numerical and 4 categorical features, and no missing values among the 500 rows.
No outliers to signal in the numerical features given the summary statistics.*

#### What's the average salary in this company?

In [77]:
employees['Salary'].mean()

73.528

#### What's the highest salary?

In [78]:
employees['Salary'].max()

120

#### What's the lowest salary?

In [80]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [83]:
# Let's look at the 10 first entries
employees.sort_values(['Salary'])[0:10]

    Department Education      Title      Name  Years  Salary
106      Admin  Bachelor  associate      Luke      4      30
214      Sales    Master         VP      Neil     11      30
27          IT  Bachelor    Analyst      Sean     12      30
128      Sales       PhD         VP      Adam      8      30
139      Sales       PhD    Analyst      Rick     11      30
266         HR       PhD  associate    Marcel     10      30
452         IT  Bachelor    Analyst  Augustin     13      30
333         IT    Master    Analyst    Edward      5      31
243         HR       PhD  associate      Chad      5      31
47       Admin  Bachelor         VP   Melissa      8      31

#### Find all the information about an employee called David.

In [84]:
employees[employees['Name']=='David']

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [85]:
employees[employees['Name']=='David']['Salary']

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [87]:
# Outputs 158 rows
employees[employees['Title']=='associate']

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [88]:
# Method 1
employees[0:3]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [93]:
# Method 2
employees.loc[0:3]

  Department Education      Title      Name  Years  Salary
0      Admin    Master  associate     David      4      58
1         IT    Master  associate    Thomas      7      45
2      Admin    Master  associate     Diana     10      52
3      Admin    Master         VP  Manuella     15      33

#### Find the employees whose title is associate and whose salary is above 55.

In [94]:
# Outputs 104 rows
employees[(employees['Title']=='associate') & (employees['Salary']>55)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [95]:
employees.groupby(['Years'])['Salary'].mean()

Years
1     75.863636
2     75.857143
3     74.571429
4     77.129032
5     73.857143
6     72.382353
7     73.840000
8     64.250000
9     76.741935
10    73.351351
11    74.866667
12    73.454545
13    71.935484
14    70.968750
15    69.758621
Name: Salary, dtype: float64

####  What is the average salary per title?

In [96]:
employees.groupby(['Title'])['Salary'].mean()

Title
Analyst      73.703911
VP           72.907975
associate    73.968354
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [115]:
quartiles = pd.qcut(employees['Salary'], 4)
quartiles.unique()

[(50.0, 72.0], (29.999, 50.0], (97.0, 120.0], (72.0, 97.0]]
Categories (4, interval[float64, right]): [(29.999, 50.0] < (50.0, 72.0] < (72.0, 97.0] < (97.0, 120.0]]

#### Is the mean salary different per gender?

*It would be computable if we had a gender column.*

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [119]:
employees.groupby(['Department'])['Years', 'Salary'].min()

C:\Users\Shinemet\AppData\Local\Temp/ipykernel_1180/1890585564.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  employees.groupby(['Department'])['Years', 'Salary'].min()

            Years  Salary
Department
Admin           1      30
HR              1      30
IT              1      30
Sales           1      30

In [120]:
employees.groupby(['Department'])['Years', 'Salary'].max()

C:\Users\Shinemet\AppData\Local\Temp/ipykernel_1180/3764135465.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  employees.groupby(['Department'])['Years', 'Salary'].max()

            Years  Salary
Department
Admin          15     120
HR             15     119
IT             15     120
Sales          15     120

In [123]:
employees.groupby(['Department'])['Years', 'Salary'].mean()

C:\Users\Shinemet\AppData\Local\Temp/ipykernel_1180/3795027651.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  employees.groupby(['Department'])['Years', 'Salary'].mean()

               Years     Salary
Department
Admin       7.642276  76.325203
HR          7.172131  74.237705
IT          8.141791  70.671642
Sales       7.206612  73.132231

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [76]:
employees.head()

  Department Education      Title      Name  Years  Salary
0      Admin    Master  associate     David      4      58
1         IT    Master  associate    Thomas      7      45
2      Admin    Master  associate     Diana     10      52
3      Admin    Master         VP  Manuella     15      33
4      Sales    Master    Analyst     Carla      6      38

In [141]:
employees.groupby('Department').apply(lambda row: row['Salary'].max() - row['Salary'].min())

Department
Admin    90
HR       89
IT       90
Sales    90
dtype: int64

In [144]:
employees.groupby('Department').agg({'Salary' : lambda row: row.max() - row.min()})

            Salary
Department
Admin           90
HR              89
IT              90
Sales           90

In [145]:
max_sal = employees.groupby(['Department'])['Salary'].max()
min_sal = employees.groupby(['Department'])['Salary'].min()
diff = max_sal - min_sal
diff

Department
Admin    90
HR       89
IT       90
Sales    90
Name: Salary, dtype: int64

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [121]:
orders = pd.read_csv(r"C:\Users\Shinemet\Downloads\Orders - Orders.csv")

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [122]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 8:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 8:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34

In [151]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    397924 non-null  int64
 1   InvoiceNo     397924 non-null  int64
 2   StockCode     397924 non-null  object
 3   year          397924 non-null  int64
 4   month         397924 non-null  int64
 5   day           397924 non-null  int64
 6   hour          397924 non-null  int64
 7   Description   397924 non-null  object
 8   Quantity      397924 non-null  int64
 9   InvoiceDate   397924 non-null  object
 10  UnitPrice     397924 non-null  float64
 11  CustomerID    397924 non-null  int64
 12  Country       397924 non-null  object
 13  amount_spent  397924 non-null  float64
dtypes: float64(2), int64(8), object(4)
memory usage: 42.5+ MB

In [149]:
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

*There are 4 object-type columns according to pandas statistics but statistics are not meaningful for all non-object columns because some provide values that cannot be not aggregated (index, invoiceno, customerID).*

####  What is the average purchase price?

In [152]:
orders['UnitPrice'].mean()

3.116174480549152

#### What are the highest and lowest purchase prices?

In [154]:
orders['UnitPrice'].min()

0.0

In [155]:
orders['UnitPrice'].max()

8142.75

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [160]:
#m1 = (df['SibSp'] > 0) | (df['Parch'] > 0)
#df.groupby(np.where(m1, 'Has Family', 'No Family'))['Survived'].mean()

#cond = (orders['Country']=='Spain')
#orders.groupby(np.where(cond))['CustomerID']
np.select(cond, orders['CustomerID'])

array(12557)

In [156]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 8:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 8:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34

#### How many customers do we have in Spain?

In [36]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [37]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [38]:
# your code here

#### Select all free orders.

In [39]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [40]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [41]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [42]:
# your code here

#### Select all orders made in the month of August.

In [43]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [44]:
# your code here

#### What's the  average amount of money spent by country?

In [45]:
# your code here

#### What's the most expensive item?

In [46]:
# your code here

#### What is the average amount spent per year?

In [47]:
# your code here